package com.tapasbeton.spisok

object BetonData {

        fun getBetons() = listOf(

            Beton("Бетон M100", "C8/10", "гранит","П1-П5", "F50", "W2"),
            Beton("Бетон M150", "C10/12.5", "гранит","П1-П5", "F50", "W2"),
            Beton("Бетон M200", "C12/15", "гранит","П1-П5", "F50", "W2"),
            Beton("Бетон M250", "C16/20", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("Бетон M300", "C18/22.5", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("Бетон M350", "C20/25", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("Бетон M400", "C25/30", "гранит","П1-П5", "F50", "W2-W6"),
            Beton("Бетон M450", "C28/35", "гранит","П1-П5", "F50", "W2-W6"),
            Beton("Бетон M500", "C30/37", "гранит","П1-П5", "F50", "W2-W8"),
            Beton("Бетон M550", "C32/40", "гранит","П1-П5", "F50", "W2-W8"),
            Beton("Бетон M600", "C35/45", "гранит","П1-П5", "F50", "W2-W10"),
            Beton("Бетон M700", "C40/50", "гранит","П1-П5", "F50", "W2-W12"),
            Beton("Бетон M100", "C8/10", "гравий","П1-П5", "F50", "W2"),
            Beton("Бетон M150", "C10/12.5", "гравий","П1-П5", "F50", "W2"),
            Beton("Бетон M200", "C12/15", "гравий","П1-П5", "F50", "W2"),
            Beton("Бетон M250", "C16/20", "гравий","П1-П5", "F50", "W2"),
            Beton("Бетон M300", "C18/22.5", "гравий","П1-П5", "F50-F75", "W2-W4"),
            Beton("Раствор известковый M10", "РСПИ", "известь","Пк1", "F50", ""),
            Beton("Раствор M50", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("Раствор M75", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("Раствор M100", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("Раствор M150", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("Раствор M200", "РСГП", "раствор","Пк1-Пк3", "F50-F100", ""),
            Beton("Раствор M250", "РСГП", "раствор","Пк1-Пк3", "F50-F100", ""),
            Beton("Раствор M300", "РСГП", "раствор","Пк1-Пк3", "F50-F100", ""),
            Beton("Керамзитобетон", "В2,5", "керамзит","П2", "D600-D1000", ""),
            Beton("Керамзитобетон", "В3,5", "керамзит","П2", "D700-D1100", ""),
            Beton("Керамзитобетон", "В5,0", "керамзит","П2", "D800-D1200", ""),
            Beton("Керамзитобетон", "В7,5", "керамзит","П2", "D900-D1300", ""),
            Beton("Керамзитобетон", "В10", "керамзит","П2", "D1000-D1400", ""),
            Beton("Керамзитобетон", "В12,5", "керамзит","П2", "D1100-D1500", ""),
            Beton("Керамзитобетон", "В15", "керамзит","П2", "D1200-D1600", ""),
            Beton("Керамзитобетон", "В20", "керамзит","П2", "D1300-D1700", "")

        )
}