package com.tapasbeton.spisok

object BetonData {

        fun getBetons() = listOf(

            Beton("M100", "C8/10", "гранит","П1-П5", "F50", "W2"),
            Beton("M150", "C10/12.5", "гранит","П1-П5", "F50", "W2"),
            Beton("M200", "C12/15", "гранит","П1-П5", "F50", "W2"),
            Beton("M250", "C16/20", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("M300", "C18/22.5", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("M350", "C20/25", "гранит","П1-П5", "F50", "W2-W4"),
            Beton("M400", "C25/30", "гранит","П1-П5", "F50", "W2-W6"),
            Beton("M450", "C28/35", "гранит","П1-П5", "F50", "W2-W6"),
            Beton("M500", "C30/37", "гранит","П1-П5", "F50", "W2-W8"),
            Beton("M550", "C32/40", "гранит","П1-П5", "F50", "W2-W8"),
            Beton("M600", "C35/45", "гранит","П1-П5", "F50", "W2-W10"),
            Beton("M700", "C40/50", "гранит","П1-П5", "F50", "W2-W12"),
            Beton("M100", "C8/10", "гравий","П1-П5", "F50", "W2"),
            Beton("M150", "C10/12.5", "гравий","П1-П5", "F50", "W2"),
            Beton("M200", "C12/15", "гравий","П1-П5", "F50", "W2"),
            Beton("M250", "C16/20", "гравий","П1-П5", "F50", "W2"),
            Beton("M300", "C18/22.5", "гравий","П1-П5", "F50-F75", "W2-W4"),
            Beton("M10", "РСПИ", "известь","Пк1", "F50", ""),
            Beton("M50", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("M75", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("M100", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("M150", "РСГП", "раствор","Пк1-Пк3", "F50", ""),
            Beton("M200", "РСГП", "раствор","Пк1-Пк3", "F50-F100", ""),
            Beton("M250", "РСГП", "раствор","Пк1-Пк3", "F50-F100", ""),
            Beton("M300", "РСГП", "раствор","Пк1-Пк3", "F50-F100", "")

        )
}